Autodesk.Revit.DB.IFC.RoofComponents.GetAreasOfCurveLoops
The areas of CurveLoops of roof slabs.
Since:
2014

Autodesk.Revit.DB.IFC.RoofComponents.GetLoopFaces
The faces of the loops of roof slabs.
Returns:
The faces.
Since:
2014

Autodesk.Revit.DB.IFC.RoofComponents.GetCurveLoops
The CurveLoops of roof slabs.
Returns:
The CurveLoops.
Since:
2014

Autodesk.Revit.DB.IFC.RoofComponents.GetPlaneOrigins
The plane origins of roof slabs.
Returns:
The origins.
Since:
2014

Autodesk.Revit.DB.IFC.RoofComponents.GetPlaneDirections
The plane directions of roof slabs.
Returns:
The directions.
Since:
2014

Autodesk.Revit.DB.IFC.RoofComponents.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.RoofComponents.ScaledDepth
The depth of the roof slab.
Since:
2014

Autodesk.Revit.DB.IFC.RoofComponents
A class that contains multiple roof slab infos of a roof.
Remarks:
This class contains a series of collections that are all of the same length, and whose nth index corresponds
to the nth slab of the roof.
Since:
2014